package cn.ltwc.cft.data;

/**
 * 
 * TODO:本应用的常量类
 * 
 * @author huangshang 2015-11-10 下午2:22:42
 * @Modified_By:
 */
public class Constant {
	public static long exitTime = 2000;// 程序退出时间
	// 农历部分假日
	public final static String[] lunarHoliday = new String[] { "0101 春节",
			"0115 元宵", "0504 皇上生辰", "0505 端午", "0706 我的生日","0707 情人", "0715 中元", "0815 中秋",
			"0909 重阳", "1208 腊八", "1224 小年", "1230 除夕" };
	// 公历部分节假日
	public final static String[] solarHoliday = new String[] { "0101 元旦",
			"0214 情人", "0308 妇女", "0312 植树", "0315 消费者权益日", "0401 愚人",
			"0501 劳动", "0504 青年", "0512 护士", "0601 儿童", "0701 建党", "0801 建军",
			 "0909 毛泽东逝世纪念", "0903 抗战胜利日", "0910 教师", "0918 九一八事变",
			"0928 孔子诞辰", "1001 国庆", "1006 老人", "1024 联合国日", "1112 孙中山诞辰纪念",
			"1213 国家公祭日", "1220 澳门回归纪念", "1225 圣诞", "1226 毛泽东诞辰纪念" };
	// 公历放假的日子
	public final static String[] solarFajia = new String[] { "0101 元旦",
			"0501 劳动", "0601 儿童", "1001 国庆" };

	// 农历放假的日子
	public final static String[] lunarFajia = new String[] { "1230 除夕",
			"0101 春节", "0115 元宵", "0504 皇上生辰", "0505 端午", "0706 我的生日","0815 中秋", "1208 腊八",
			"1224 小年",

	};

}
